Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX2051MTC128S1.atdf
          </instance>
        </module>
        <module name="TC" id="44162" version="D">
          <instance name="TC0">
            <register-group address-space="base" name="TC0" name-in-module="TC" offset="0x40038000"/>
            <parameters>
              <param name="INSTANCE_ID_CHANNEL0" value="31"/>
              <param name="CLOCK_ID_CHANNEL0" value="31"/>
              <param name="INSTANCE_ID_CHANNEL1" value="32"/>
              <param name="CLOCK_ID_CHANNEL1" value="32"/>
              <param name="INSTANCE_ID_CHANNEL2" value="33"/>
              <param name="CLOCK_ID_CHANNEL2" value="33"/>
              <param name="INSTANCE_ID_C0SEC" value="40"/>
              <param name="INSTANCE_ID_C1SEC" value="41"/>
              <param name="INSTANCE_ID_C2SEC" value="42"/>
              <param name="TCCLKS_" value="0" caption="MCK0DIV"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK0DIV/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK0DIV/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK0DIV/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="MD_SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PA23" function="D" group="TCLK" index="0"/>
              <signal pad="PB1" function="D" group="TCLK" index="1"/>
              <signal pad="PB4" function="D" group="TCLK" index="2"/>
              <signal pad="PA2" function="B" group="TIOA" index="0"/>
              <signal pad="PA25" function="D" group="TIOA" index="0"/>
              <signal pad="PA31" function="D" group="TIOA" index="1"/>
              <signal pad="PB2" function="D" group="TIOA" index="2"/>
              <signal pad="PA3" function="A" group="TIOB" index="0"/>
              <signal pad="PA24" function="D" group="TIOB" index="0"/>
              <signal pad="PB0" function="D" group="TIOB" index="1"/>
              <signal pad="PB3" function="D" group="TIOB" index="2"/>
            </signals>
          </instance>
          <instance name="TC1">
            <register-group address-space="base" name="TC1" name-in-module="TC" offset="0x4003C000"/>
            <parameters>
              <param name="INSTANCE_ID_CHANNEL0" value="34"/>
              <param name="CLOCK_ID_CHANNEL0" value="34"/>
              <param name="INSTANCE_ID_CHANNEL1" value="35"/>
              <param name="CLOCK_ID_CHANNEL1" value="35"/>
              <param name="INSTANCE_ID_CHANNEL2" value="36"/>
              <param name="CLOCK_ID_CHANNEL2" value="36"/>
              <param name="INSTANCE_ID_C0SEC" value="43"/>
              <param name="INSTANCE_ID_C1SEC" value="44"/>
              <param name="INSTANCE_ID_C2SEC" value="45"/>
              <param name="TCCLKS_" value="0" caption="MCK0DIV"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK0DIV/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK0DIV/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK0DIV/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="MD_SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PB14" function="C" group="TCLK" index="3"/>
              <signal pad="PB17" function="C" group="TCLK" index="4"/>
              <signal pad="PC5" function="D" group="TCLK" index="5"/>
              <signal pad="PB8" function="C" group="TIOA" index="3"/>
              <signal pad="PC0" function="C" group="TIOA" index="3"/>
              <signal pad="PB18" function="C" group="TIOA" index="4"/>
              <signal pad="PB5" function="C" group="TIOA" index="5"/>
              <signal pad="PB24" function="C" group="TIOA" index="5"/>
              <signal pad="PB13" function="C" group="TIOB" index="3"/>
              <signal pad="PB19" function="C" group="TIOB" index="4"/>
              <signal pad="PB6" function="C" group="TIOB" index="5"/>
              <signal pad="PB25" function="C" group="TIOB" index="5"/>
            </signals>
          </instance>
          <instance name="TC2">
            <register-group address-space="base" name="TC2" name-in-module="TC" offset="0x40040000"/>
            <parameters>
              <param name="INSTANCE_ID_CHANNEL0" value="37"/>
              <param name="CLOCK_ID_CHANNEL0" value="37"/>
              <param name="INSTANCE_ID_CHANNEL1" value="38"/>
              <param name="CLOCK_ID_CHANNEL1" value="38"/>
              <param name="INSTANCE_ID_CHANNEL2" value="39"/>
              <param name="CLOCK_ID_CHANNEL2" value="39"/>
              <param name="INSTANCE_ID_C0SEC" value="46"/>
              <param name="INSTANCE_ID_C1SEC" value="47"/>
              <param name="INSTANCE_ID_C2SEC" value="48"/>
              <param name="TCCLKS_" value="0" caption="MCK0DIV"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK0DIV/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK0DIV/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK0DIV/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="MD_SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PA10" function="C" group="TCLK" index="6"/>
              <signal pad="PC16" function="D" group="TCLK" index="7"/>
              <signal pad="PC19" function="D" group="TCLK" index="8"/>
              <signal pad="PA6" function="C" group="TIOA" index="6"/>
              <signal pad="PC14" function="D" group="TIOA" index="7"/>
              <signal pad="PC17" function="D" group="TIOA" index="8"/>
              <signal pad="PA7" function="C" group="TIOB" index="6"/>
              <signal pad="PC15" function="D" group="TIOB" index="7"/>
              <signal pad="PC18" function="D" group="TIOB" index="8"/>
            </signals>
          </instance>
          <instance name="TC3">
            <register-group address-space="base" name="TC3" name-in-module="TC" offset="0x48008000"/>
            <parameters>
              <param name="INSTANCE_ID_CHANNEL0" value="79"/>
              <param name="CLOCK_ID_CHANNEL0" value="79"/>
              <param name="INSTANCE_ID_CHANNEL1" value="80"/>
              <param name="CLOCK_ID_CHANNEL1" value="80"/>
              <param name="INSTANCE_ID_CHANNEL2" value="81"/>
              <param name="CLOCK_ID_CHANNEL2" value="81"/>
              <param name="INSTANCE_ID_C0SEC" value="82"/>
              <param name="INSTANCE_ID_C1SEC" value="83"/>
              <param name="INSTANCE_ID_C2SEC" value="84"/>
              <param name="TCCLKS_" value="0" caption="MCK0DIV"/>
              <param name="TCCLKS_TIMER_CLOCK1" value="1" caption="GCLK"/>
              <param name="TCCLKS_TIMER_CLOCK2" value="2" caption="MCK0DIV/8"/>
              <param name="TCCLKS_TIMER_CLOCK3" value="3" caption="MCK0DIV/32"/>
              <param name="TCCLKS_TIMER_CLOCK4" value="4" caption="MCK0DIV/128"/>
              <param name="TCCLKS_TIMER_CLOCK5" value="5" caption="MD_SLCK"/>
              <param name="TCCLKS_XC0" value="6" caption="XC0"/>
              <param name="TCCLKS_XC1" value="7" caption="XC1"/>
              <param name="TCCLKS_XC2" value="8" caption="XC2"/>
              <param name="NUM_INTERRUPT_LINES" value="3"/>
              <param name="TIMER_WIDTH" value="32"/>
            </parameters>
            <signals>
              <signal pad="PD3" function="A" group="TCLK" index="9"/>
              <signal pad="PD16" function="A" group="TCLK" index="10"/>
              <signal pad="PD19" function="C" group="TCLK" index="11"/>
              <signal pad="PD0" function="A" group="TIOA" index="9"/>
              <signal pad="PD14" function="A" group="TIOA" index="10"/>
              <signal pad="PD17" function="C" group="TIOA" index="11"/>
              <signal pad="PD4" function="A" group="TIOB" index="9"/>
              <signal pad="PD15" function="A" group="TIOB" index="10"/>
              <signal pad="PD18" function="C" group="TIOB" index="11"/>
            </signals>
          </instance>
        </module>
        <module name="UART" id="6418" version="ZA">
          <instance name="UART">
            <register-group address-space="base" name="UART" name-in-module="UART" offset="0x48010000"/>
            <parameters>
              <param name="INSTANCE_ID" value="87"/>
              <param name="CLOCK_ID" value="87"/>
            </parameters>
            <signals>
              <signal pad="PD1" function="A" group="URXD"/>
              <signal pad="PD12" function="A" group="URXD"/>
              <signal pad="PD2" function="A" group="UTXD"/>
              <signal pad="PD13" function="A" group="UTXD"/>
            </signals>
          </instance>
        </module>
