Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX2051MTC128S1.atdf
        <register caption="USART FIFO Event Status Register" name="FLEX_US_FESR" offset="0x2B4" rw="R" size="4">
          <bitfield caption="Transmit FIFO Empty Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)" mask="0x00000001" name="TXFEF"/>
          <bitfield caption="Transmit FIFO Full Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)" mask="0x00000002" name="TXFFF"/>
          <bitfield caption="Transmit FIFO Threshold Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)" mask="0x00000004" name="TXFTHF"/>
          <bitfield caption="Receive FIFO Empty Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)" mask="0x00000008" name="RXFEF"/>
          <bitfield caption="Receive FIFO Full Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)" mask="0x00000010" name="RXFFF"/>
          <bitfield caption="Receive FIFO Threshold Flag (cleared by writing the FLEX_US_CR.RSTSTA bit)" mask="0x00000020" name="RXFTHF"/>
          <bitfield caption="Transmit FIFO Pointer Error Flag" mask="0x00000040" name="TXFPTEF"/>
          <bitfield caption="Receive FIFO Pointer Error Flag" mask="0x00000080" name="RXFPTEF"/>
          <bitfield caption="Transmit FIFO Lock" mask="0x00000100" name="TXFLOCK"/>
          <bitfield caption="Receive FIFO Threshold Flag 2 (cleared by writing the FLEX_US_CR.RSTSTA bit)" mask="0x00000200" name="RXFTHF2"/>
        </register>
        <register caption="USART Write Protection Mode Register" name="FLEX_US_WPMR" offset="0x2E4" rw="RW" size="4">
          <bitfield caption="Write Protection Enable" mask="0x00000001" name="WPEN"/>
          <bitfield caption="Write Protection Interrupt Enable" mask="0x00000002" name="WPITEN"/>
          <bitfield caption="Write Protection Control Enable" mask="0x00000004" name="WPCREN"/>
          <bitfield caption="Write Protection Key" mask="0xFFFFFF00" name="WPKEY" values="FLEX_US_WPMR__WPKEY"/>
        </register>
        <register caption="USART Write Protection Status Register" name="FLEX_US_WPSR" offset="0x2E8" rw="R" size="4">
          <bitfield caption="Write Protection Violation Status" mask="0x00000001" name="WPVS"/>
          <bitfield caption="Write Protection Violation Source" mask="0x00FFFF00" name="WPVSRC"/>
        </register>
        <register caption="SPI Control Register" name="FLEX_SPI_CR" offset="0x400" rw="W" size="4">
          <bitfield caption="SPI Enable" mask="0x00000001" name="SPIEN"/>
          <bitfield caption="SPI Disable" mask="0x00000002" name="SPIDIS"/>
          <bitfield caption="SPI Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="Request to Clear the Comparison Trigger" mask="0x00001000" name="REQCLR"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x00010000" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x00020000" name="RXFCLR"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
          <bitfield caption="FIFO Enable" mask="0x40000000" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x80000000" name="FIFODIS"/>
        </register>
        <register caption="SPI Mode Register" name="FLEX_SPI_MR" offset="0x404" rw="RW" size="4">
          <bitfield caption="Host/Client Mode" mask="0x00000001" name="MSTR"/>
          <bitfield caption="Peripheral Select" mask="0x00000002" name="PS"/>
          <bitfield caption="Chip Select Decode" mask="0x00000004" name="PCSDEC"/>
          <bitfield caption="Bit Rate Source Clock" mask="0x00000008" name="BRSRCCLK" values="FLEX_SPI_MR__BRSRCCLK"/>
          <bitfield caption="Mode Fault Detection" mask="0x00000010" name="MODFDIS"/>
          <bitfield caption="Wait Data Read Before Transfer" mask="0x00000020" name="WDRBT"/>
          <bitfield caption="Local Loopback Enable" mask="0x00000080" name="LLB"/>
          <bitfield caption="Comparison Mode" mask="0x00001000" name="CMPMODE" values="FLEX_SPI_MR__CMPMODE"/>
          <bitfield caption="Peripheral Chip Select" mask="0x00030000" name="PCS"/>
          <bitfield caption="Delay Between Chip Selects" mask="0xFF000000" name="DLYBCS"/>
        </register>
        <register caption="SPI Receive Data Register" name="FLEX_SPI_RDR" offset="0x408" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA_8"/>
          <mode name="FIFO_MULTI_DATA_16"/>
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD" modes="DEFAULT"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS" modes="DEFAULT"/>
          <bitfield caption="Receive Data" mask="0x000000FF" name="RD0" modes="FIFO_MULTI_DATA_8"/>
          <bitfield caption="Receive Data" mask="0x0000FF00" name="RD1" modes="FIFO_MULTI_DATA_8"/>
          <bitfield caption="Receive Data" mask="0x00FF0000" name="RD2" modes="FIFO_MULTI_DATA_8"/>
          <bitfield caption="Receive Data" mask="0xFF000000" name="RD3" modes="FIFO_MULTI_DATA_8"/>
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD0" modes="FIFO_MULTI_DATA_16"/>
          <bitfield caption="Receive Data" mask="0xFFFF0000" name="RD1" modes="FIFO_MULTI_DATA_16"/>
        </register>
        <register caption="SPI Transmit Data Register" name="FLEX_SPI_TDR" offset="0x40C" rw="W" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA"/>
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD" modes="DEFAULT"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS" modes="DEFAULT"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER" modes="DEFAULT"/>
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD0" modes="FIFO_MULTI_DATA"/>
          <bitfield caption="Transmit Data" mask="0xFFFF0000" name="TD1" modes="FIFO_MULTI_DATA"/>
        </register>
        <register caption="SPI Status Register" name="FLEX_SPI_SR" offset="0x410" rw="R" size="4">
          <bitfield caption="Receive Data Register Full (cleared by reading FLEX_SPI_RDR)" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty (cleared by writing FLEX_SPI_TDR)" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error (cleared on read)" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Status (cleared on read)" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of RX Buffer (cleared by writing FLEX_SPI_RCR or FLEX_SPI_RNCR)" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of TX Buffer (cleared by writing FLEX_SPI_TCR or FLEX_SPI_TNCR)" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="RX Buffer Full (cleared by writing FLEX_SPI_RCR or FLEX_SPI_RNCR)" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty (cleared by writing FLEX_SPI_TCR or FLEX_SPI_TNCR)" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising (cleared on read)" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty (cleared by writing FLEX_SPI_TDR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Status (Client mode only) (cleared on read)" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Status (cleared on read)" mask="0x00000800" name="CMP"/>
          <bitfield caption="Client Mode Frame Error (cleared on read)" mask="0x00001000" name="SFERR"/>
          <bitfield caption="SPI Enable Status" mask="0x00010000" name="SPIENS"/>
          <bitfield caption="Transmit FIFO Empty Flag (cleared on read)" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="Transmit FIFO Full Flag (cleared on read)" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="Transmit FIFO Threshold Flag (cleared on read)" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="Receive FIFO Empty Flag" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="Receive FIFO Full Flag" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="Receive FIFO Threshold Flag" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="Transmit FIFO Pointer Error Flag" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="Receive FIFO Pointer Error Flag" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="SPI Interrupt Enable Register" name="FLEX_SPI_IER" offset="0x414" rw="W" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="SPI Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Enable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising Interrupt Enable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Interrupt Enable" mask="0x00000800" name="CMP"/>
          <bitfield caption="Client Mode Frame Error Interrupt Enable" mask="0x00001000" name="SFERR"/>
          <bitfield caption="TXFEF Interrupt Enable" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Enable" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Enable" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Enable" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Enable" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Enable" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Enable" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Enable" mask="0x80000000" name="RXFPTEF"/>
        </register>
