Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX2051MTC128S1.atdf
      <value-group caption="Default Master Type" name="MATRIX_SCFG__DEFMSTR_TYPE">
        <value caption="No Default Master-At the end of the current slave access, if no other master request is pending, the slave is disconnected from all masters. This results in a one clock cycle latency for the first access of a burst transfer or for a single access." name="NONE" value="0x0"/>
        <value caption="Last Default Master-At the end of the current slave access, if no other master request is pending, the slave stays connected to the last master having accessed it. This results in not having one clock cycle latency when the last master tries to access the slave again." name="LAST" value="0x1"/>
        <value caption="Fixed Default Master-At the end of the current slave access, if no other master request is pending, the slave connects to the fixed master the number that has been written in the FIXED_DEFMSTR field. This results in not having one clock cycle latency when the fixed master tries to access the slave again." name="FIXED" value="0x2"/>
      </value-group>
      <value-group caption="Write Protection Key" name="MATRIX_WPMR__WPKEY">
        <value caption="Writing any other value in this field aborts the write operation of the WPEN and CFGFRZ bits. Always reads as 0." name="PASSWD" value="0x4D4154"/>
      </value-group>
    </module>
    <module caption="Multi Channel Serial Peripheral Interface" name="MCSPI" id="04462" version="H">
      <register-group name="MCSPI">
        <register caption="Control Register" name="MCSPI_CR" offset="0x00" rw="W" size="4">
          <bitfield caption="MCSPI Enable" mask="0x00000001" name="SPIEN"/>
          <bitfield caption="MCSPI Disable" mask="0x00000002" name="SPIDIS"/>
          <bitfield caption="MCSPI Software Reset" mask="0x00000080" name="SWRST"/>
          <bitfield caption="Request to Clear the Comparison Trigger" mask="0x00001000" name="REQCLR"/>
          <bitfield caption="Transmit FIFO Clear" mask="0x00010000" name="TXFCLR"/>
          <bitfield caption="Receive FIFO Clear" mask="0x00020000" name="RXFCLR"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER"/>
          <bitfield caption="FIFO Enable" mask="0x40000000" name="FIFOEN"/>
          <bitfield caption="FIFO Disable" mask="0x80000000" name="FIFODIS"/>
        </register>
        <register caption="Mode Register" name="MCSPI_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Host/Client Mode" mask="0x00000001" name="MSTR"/>
          <bitfield caption="Peripheral Select" mask="0x00000002" name="PS"/>
          <bitfield caption="Chip Select Decode" mask="0x00000004" name="PCSDEC"/>
          <bitfield caption="Bit Rate Source Clock" mask="0x00000008" name="BRSRCCLK" values="MCSPI_MR__BRSRCCLK"/>
          <bitfield caption="Mode Fault Detection" mask="0x00000010" name="MODFDIS"/>
          <bitfield caption="Wait for Data Read Before Transfer" mask="0x00000020" name="WDRBT"/>
          <bitfield caption="CRC Enable" mask="0x00000040" name="CRCEN"/>
          <bitfield caption="Local Loopback Enable" mask="0x00000080" name="LLB"/>
          <bitfield caption="LSB Timing Selection" mask="0x00000100" name="LSBHALF"/>
          <bitfield caption="Two-pin MOSI Chip Select External Multiplexing Mode" mask="0x00000200" name="TMCSMUX" values="MCSPI_MR__TMCSMUX"/>
          <bitfield caption="Comparison Mode" mask="0x00001000" name="CMPMODE" values="MCSPI_MR__CMPMODE"/>
          <bitfield caption="Two-Pin Mode Enable" mask="0x00002000" name="TPMEN"/>
          <bitfield caption="Chip Select Inversion Enable" mask="0x00004000" name="CSIE"/>
          <bitfield caption="MOSI Inversion Enable" mask="0x00008000" name="MOSIIE"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS"/>
          <bitfield caption="Delay Between Chip Selects" mask="0xFF000000" name="DLYBCS"/>
        </register>
        <register caption="Receive Data Register" name="MCSPI_RDR" offset="0x08" rw="R" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA_8"/>
          <mode name="FIFO_MULTI_DATA_16"/>
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD" modes="DEFAULT"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS" modes="DEFAULT"/>
          <bitfield caption="Receive Data" mask="0x000000FF" name="RD0" modes="FIFO_MULTI_DATA_8"/>
          <bitfield caption="Receive Data" mask="0x0000FF00" name="RD1" modes="FIFO_MULTI_DATA_8"/>
          <bitfield caption="Receive Data" mask="0x00FF0000" name="RD2" modes="FIFO_MULTI_DATA_8"/>
          <bitfield caption="Receive Data" mask="0xFF000000" name="RD3" modes="FIFO_MULTI_DATA_8"/>
          <bitfield caption="Receive Data" mask="0x0000FFFF" name="RD0" modes="FIFO_MULTI_DATA_16"/>
          <bitfield caption="Receive Data" mask="0xFFFF0000" name="RD1" modes="FIFO_MULTI_DATA_16"/>
        </register>
        <register caption="Transmit Data Register" name="MCSPI_TDR" offset="0x0C" rw="W" size="4">
          <mode name="DEFAULT"/>
          <mode name="FIFO_MULTI_DATA"/>
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD" modes="DEFAULT"/>
          <bitfield caption="Peripheral Chip Select" mask="0x000F0000" name="PCS" modes="DEFAULT"/>
          <bitfield caption="Last Transfer" mask="0x01000000" name="LASTXFER" modes="DEFAULT"/>
          <bitfield caption="Transmit Data" mask="0x0000FFFF" name="TD0" modes="FIFO_MULTI_DATA"/>
          <bitfield caption="Transmit Data" mask="0xFFFF0000" name="TD1" modes="FIFO_MULTI_DATA"/>
        </register>
        <register caption="Status Register" name="MCSPI_SR" offset="0x10" rw="R" size="4">
          <bitfield caption="Receive Data Register Full (cleared by reading MCSPI_RDR)" mask="0x00000001" name="RDRF"/>
          <bitfield caption="Transmit Data Register Empty (cleared by writing MCSPI_TDR)" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error (cleared on read)" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Status (cleared on read)" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of RX Buffer (cleared by writing MCSPI_RCR or MCSPI_RNCR)" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of TX Buffer (cleared by writing MCSPI_TCR or MCSPI_TNCR)" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="RX Buffer Full (cleared by writing MCSPI_RCR or MCSPI_RNCR)" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="TX Buffer Empty (cleared by writing MCSPI_TCR or MCSPI_TNCR)" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising (cleared on read)" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty (cleared by writing MCSPI_TDR)" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Status (Client mode only) (cleared on read)" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Status (cleared on read)" mask="0x00000800" name="CMP"/>
          <bitfield caption="Client Frame Error (cleared on read)" mask="0x00001000" name="SFERR"/>
          <bitfield caption="CRC Error (cleared on read)" mask="0x00002000" name="CRCERR"/>
          <bitfield caption="MCSPI Enable Status" mask="0x00010000" name="SPIENS"/>
          <bitfield caption="Transmit FIFO Empty Flag (cleared on read)" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="Transmit FIFO Full Flag (cleared on read)" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="Transmit FIFO Threshold Flag (cleared on read)" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="Receive FIFO Empty Flag" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="Receive FIFO Full Flag" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="Receive FIFO Threshold Flag" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="Transmit FIFO Pointer Error Flag" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="Receive FIFO Pointer Error Flag" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="Interrupt Enable Register" name="MCSPI_IER" offset="0x14" rw="W" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Enable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="MCSPI Transmit Data Register Empty Interrupt Enable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Enable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Enable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Enable" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Enable" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising Interrupt Enable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Enable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Enable" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Interrupt Enable" mask="0x00000800" name="CMP"/>
          <bitfield caption="CRC Error Interrupt Enable" mask="0x00002000" name="CRCERR"/>
          <bitfield caption="TXFEF Interrupt Enable" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Enable" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Enable" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Enable" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Enable" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Enable" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Enable" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Enable" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="Interrupt Disable Register" name="MCSPI_IDR" offset="0x18" rw="W" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Disable" mask="0x00000001" name="RDRF"/>
          <bitfield caption="MCSPI Transmit Data Register Empty Interrupt Disable" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Disable" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Disable" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Disable" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Disable" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising Interrupt Disable" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Disable" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Disable" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Interrupt Disable" mask="0x00000800" name="CMP"/>
          <bitfield caption="CRC Error Interrupt Disable" mask="0x00002000" name="CRCERR"/>
          <bitfield caption="TXFEF Interrupt Disable" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Disable" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Disable" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Disable" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Disable" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Disable" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Disable" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Disable" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="Interrupt Mask Register" name="MCSPI_IMR" offset="0x1C" rw="R" size="4">
          <bitfield caption="Receive Data Register Full Interrupt Mask" mask="0x00000001" name="RDRF"/>
          <bitfield caption="MCSPI Transmit Data Register Empty Interrupt Mask" mask="0x00000002" name="TDRE"/>
          <bitfield caption="Mode Fault Error Interrupt Mask" mask="0x00000004" name="MODF"/>
          <bitfield caption="Overrun Error Interrupt Mask" mask="0x00000008" name="OVRES"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x00000010" name="ENDRX"/>
          <bitfield caption="End of Transmit Buffer Interrupt Mask" mask="0x00000020" name="ENDTX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x00000040" name="RXBUFF"/>
          <bitfield caption="Transmit Buffer Empty Interrupt Mask" mask="0x00000080" name="TXBUFE"/>
          <bitfield caption="NSS Rising Interrupt Mask" mask="0x00000100" name="NSSR"/>
          <bitfield caption="Transmission Registers Empty Mask" mask="0x00000200" name="TXEMPTY"/>
          <bitfield caption="Underrun Error Interrupt Mask" mask="0x00000400" name="UNDES"/>
          <bitfield caption="Comparison Interrupt Mask" mask="0x00000800" name="CMP"/>
          <bitfield caption="CRC Error Interrupt Mask" mask="0x00002000" name="CRCERR"/>
          <bitfield caption="TXFEF Interrupt Mask" mask="0x01000000" name="TXFEF"/>
          <bitfield caption="TXFFF Interrupt Mask" mask="0x02000000" name="TXFFF"/>
          <bitfield caption="TXFTHF Interrupt Mask" mask="0x04000000" name="TXFTHF"/>
          <bitfield caption="RXFEF Interrupt Mask" mask="0x08000000" name="RXFEF"/>
          <bitfield caption="RXFFF Interrupt Mask" mask="0x10000000" name="RXFFF"/>
          <bitfield caption="RXFTHF Interrupt Mask" mask="0x20000000" name="RXFTHF"/>
          <bitfield caption="TXFPTEF Interrupt Mask" mask="0x40000000" name="TXFPTEF"/>
          <bitfield caption="RXFPTEF Interrupt Mask" mask="0x80000000" name="RXFPTEF"/>
        </register>
        <register caption="Chip Select Register (CS_number = 0)" name="MCSPI_CSR" offset="0x30" rw="RW" size="4" count="4">
          <bitfield caption="Clock Polarity" mask="0x00000001" name="CPOL"/>
          <bitfield caption="Clock Phase" mask="0x00000002" name="NCPHA"/>
          <bitfield caption="Chip Select Not Active After Transfer (ignored if CSAAT = 1)" mask="0x00000004" name="CSNAAT"/>
          <bitfield caption="Chip Select Active After Transfer" mask="0x00000008" name="CSAAT"/>
          <bitfield caption="Bits Per Transfer" mask="0x000000F0" name="BITS" values="MCSPI_CSR__BITS"/>
          <bitfield caption="Serial Clock Bit Rate" mask="0x0000FF00" name="SCBR"/>
          <bitfield caption="Delay Before SPCK" mask="0x00FF0000" name="DLYBS"/>
          <bitfield caption="Delay Between Consecutive Transfers" mask="0xFF000000" name="DLYBCT"/>
        </register>
        <register caption="FIFO Mode Register" name="MCSPI_FMR" offset="0x40" rw="RW" size="4">
          <bitfield caption="Transmit Data Register Empty Mode" mask="0x00000003" name="TXRDYM" values="MCSPI_FMR__TXRDYM"/>
          <bitfield caption="Receive Data Register Full Mode" mask="0x00000030" name="RXRDYM" values="MCSPI_FMR__RXRDYM"/>
          <bitfield caption="Transmit FIFO Threshold" mask="0x003F0000" name="TXFTHRES"/>
          <bitfield caption="Receive FIFO Threshold" mask="0x3F000000" name="RXFTHRES"/>
        </register>
        <register caption="FIFO Level Register" name="MCSPI_FLR" offset="0x44" rw="R" size="4">
          <bitfield caption="Transmit FIFO Level" mask="0x0000003F" name="TXFL"/>
          <bitfield caption="Receive FIFO Level" mask="0x003F0000" name="RXFL"/>
        </register>
        <register caption="Comparison Register" name="MCSPI_CMPR" offset="0x48" rw="RW" size="4">
          <bitfield caption="First Comparison Value for Received Character" mask="0x0000FFFF" name="VAL1"/>
          <bitfield caption="Second Comparison Value for Received Character" mask="0xFFFF0000" name="VAL2"/>
        </register>
