Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTC/atdf/PIC32CX2051MTC128S1.atdf
        <register caption="PIO Interrupt Status Register" name="PIO_ISR" offset="0x2C" rw="R" size="4">
          <bitfield caption="Input Change Interrupt Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Input Change Interrupt Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="PIO I/O Freeze Configuration Register" name="PIO_IOFR" offset="0x3C" rw="W" size="4">
          <bitfield caption="Freeze Physical Configuration" mask="0x00000001" name="FPHY"/>
          <bitfield caption="Freeze Interrupt Configuration" mask="0x00000002" name="FINT"/>
          <bitfield caption="Freeze Key" mask="0xFFFFFF00" name="FRZKEY" values="PIO_IOFR0__FRZKEY"/>
        </register>
      </register-group>
      <register-group name="PIO_P" size="64">
        <register caption="PIO Privilege Mask Register (p_iogroup = 0)" name="PIO_P_MSKR" offset="0x0" rw="RW" size="4">
          <bitfield caption="PIO Line 0 Mask" mask="0x00000001" name="MSK0" values="PIO_P_MSKR0__MSK0"/>
          <bitfield caption="PIO Line 1 Mask" mask="0x00000002" name="MSK1" values="PIO_P_MSKR0__MSK1"/>
          <bitfield caption="PIO Line 2 Mask" mask="0x00000004" name="MSK2" values="PIO_P_MSKR0__MSK2"/>
          <bitfield caption="PIO Line 3 Mask" mask="0x00000008" name="MSK3" values="PIO_P_MSKR0__MSK3"/>
          <bitfield caption="PIO Line 4 Mask" mask="0x00000010" name="MSK4" values="PIO_P_MSKR0__MSK4"/>
          <bitfield caption="PIO Line 5 Mask" mask="0x00000020" name="MSK5" values="PIO_P_MSKR0__MSK5"/>
          <bitfield caption="PIO Line 6 Mask" mask="0x00000040" name="MSK6" values="PIO_P_MSKR0__MSK6"/>
          <bitfield caption="PIO Line 7 Mask" mask="0x00000080" name="MSK7" values="PIO_P_MSKR0__MSK7"/>
          <bitfield caption="PIO Line 8 Mask" mask="0x00000100" name="MSK8" values="PIO_P_MSKR0__MSK8"/>
          <bitfield caption="PIO Line 9 Mask" mask="0x00000200" name="MSK9" values="PIO_P_MSKR0__MSK9"/>
          <bitfield caption="PIO Line 10 Mask" mask="0x00000400" name="MSK10" values="PIO_P_MSKR0__MSK10"/>
          <bitfield caption="PIO Line 11 Mask" mask="0x00000800" name="MSK11" values="PIO_P_MSKR0__MSK11"/>
          <bitfield caption="PIO Line 12 Mask" mask="0x00001000" name="MSK12" values="PIO_P_MSKR0__MSK12"/>
          <bitfield caption="PIO Line 13 Mask" mask="0x00002000" name="MSK13" values="PIO_P_MSKR0__MSK13"/>
          <bitfield caption="PIO Line 14 Mask" mask="0x00004000" name="MSK14" values="PIO_P_MSKR0__MSK14"/>
          <bitfield caption="PIO Line 15 Mask" mask="0x00008000" name="MSK15" values="PIO_P_MSKR0__MSK15"/>
          <bitfield caption="PIO Line 16 Mask" mask="0x00010000" name="MSK16" values="PIO_P_MSKR0__MSK16"/>
          <bitfield caption="PIO Line 17 Mask" mask="0x00020000" name="MSK17" values="PIO_P_MSKR0__MSK17"/>
          <bitfield caption="PIO Line 18 Mask" mask="0x00040000" name="MSK18" values="PIO_P_MSKR0__MSK18"/>
          <bitfield caption="PIO Line 19 Mask" mask="0x00080000" name="MSK19" values="PIO_P_MSKR0__MSK19"/>
          <bitfield caption="PIO Line 20 Mask" mask="0x00100000" name="MSK20" values="PIO_P_MSKR0__MSK20"/>
          <bitfield caption="PIO Line 21 Mask" mask="0x00200000" name="MSK21" values="PIO_P_MSKR0__MSK21"/>
          <bitfield caption="PIO Line 22 Mask" mask="0x00400000" name="MSK22" values="PIO_P_MSKR0__MSK22"/>
          <bitfield caption="PIO Line 23 Mask" mask="0x00800000" name="MSK23" values="PIO_P_MSKR0__MSK23"/>
          <bitfield caption="PIO Line 24 Mask" mask="0x01000000" name="MSK24" values="PIO_P_MSKR0__MSK24"/>
          <bitfield caption="PIO Line 25 Mask" mask="0x02000000" name="MSK25" values="PIO_P_MSKR0__MSK25"/>
          <bitfield caption="PIO Line 26 Mask" mask="0x04000000" name="MSK26" values="PIO_P_MSKR0__MSK26"/>
          <bitfield caption="PIO Line 27 Mask" mask="0x08000000" name="MSK27" values="PIO_P_MSKR0__MSK27"/>
          <bitfield caption="PIO Line 28 Mask" mask="0x10000000" name="MSK28" values="PIO_P_MSKR0__MSK28"/>
          <bitfield caption="PIO Line 29 Mask" mask="0x20000000" name="MSK29" values="PIO_P_MSKR0__MSK29"/>
          <bitfield caption="PIO Line 30 Mask" mask="0x40000000" name="MSK30" values="PIO_P_MSKR0__MSK30"/>
          <bitfield caption="PIO Line 31 Mask" mask="0x80000000" name="MSK31" values="PIO_P_MSKR0__MSK31"/>
        </register>
        <register caption="PIO Privilege Configuration Register (p_iogroup = 0)" name="PIO_P_CFGR" offset="0x4" rw="RW" size="4">
          <bitfield caption="I/O Line Function" mask="0x00000007" name="FUNC" values="PIO_P_CFGR0__FUNC"/>
          <bitfield caption="Direction" mask="0x00000100" name="DIR" values="PIO_P_CFGR0__DIR"/>
          <bitfield caption="Pull-Up Enable" mask="0x00000200" name="PUEN" values="PIO_P_CFGR0__PUEN"/>
          <bitfield caption="Pull-Down Enable" mask="0x00000400" name="PDEN" values="PIO_P_CFGR0__PDEN"/>
          <bitfield caption="Input Filter Enable" mask="0x00001000" name="IFEN" values="PIO_P_CFGR0__IFEN"/>
          <bitfield caption="Input Filter Slow Clock Enable" mask="0x00002000" name="IFSCEN"/>
          <bitfield caption="Open-Drain" mask="0x00004000" name="OPD" values="PIO_P_CFGR0__OPD"/>
          <bitfield caption="Schmitt Trigger" mask="0x00008000" name="SCHMITT" values="PIO_P_CFGR0__SCHMITT"/>
          <bitfield caption="Slew Rate" mask="0x00030000" name="SLEWRATE" values="PIO_P_CFGR0__SLEWRATE"/>
          <bitfield caption="Event Selection" mask="0x07000000" name="EVTSEL" values="PIO_P_CFGR0__EVTSEL"/>
          <bitfield caption="Physical Configuration Freeze Status (read-only)" mask="0x20000000" name="PCFS" values="PIO_P_CFGR0__PCFS"/>
          <bitfield caption="Interrupt Configuration Freeze Status (read-only)" mask="0x40000000" name="ICFS" values="PIO_P_CFGR0__ICFS"/>
        </register>
